# import random
# a="""01.马渝越
# 02.刘瀚阳
# 03.石瀚文
# 04.王文杰
# 05.张志诚
# 06.苟城豪
# 07.徐肃然
# 08.常瀚予
# 09.余俊昇
# 10.胡予宸
# 11.王世博
# 12.唐泓烨
# 13.曾海星
# 14.郑博文
# 15.何宇晨
# 16.李文瑞
# 17.赵元浩
# 18.文俊翔
# 19.吴锦阳
# 20.陈尚子
# 21.王若妍
# 22.王艺涵
# 23.闫妍 1
# 24.袁新然
# 25.董彦岭
# 26.骆彦希
# 27.汪子钧
# 28.杨涵雅
# 29.郑文沛
# 30.梁雅婷
# 31.徐翠敏
# 32.于跃悦
# 33.王若羲
# 34.向芷萱
# 35.裴浠为
# 36.曾可欣
# 37.郑茗予
# 38.陈伽余
# 39.王语欧
# 40.吴臻  """
# name=a.splitlines()
# f=list(random.randint(60,100) for x in range(40))
# print(name)
# print(f)
# d=dict(zip(name,f))
# print(d)
a={'01.马渝越': 90, '02.刘瀚阳': 81, '03.石瀚文': 62, '04.王文杰': 71,
   '05.张志诚': 75, '06.苟城豪': 60, '07.徐肃然': 84, '08.常瀚予': 70,
   '09.余俊昇': 95, '10.胡予宸': 66, '11.王世博': 97, '12.唐泓烨': 81,
   '13.曾海星': 73, '14.郑博文': 93, '15.何宇晨': 74, '16.李文瑞': 88, '17.赵元浩': 92, '18.文俊翔': 98, '19.吴锦阳': 83, '20.陈尚子': 84, '21.王若妍': 97, '22.王艺涵': 98, '23.闫妍 1': 78, '24.袁新然': 93, '25.董彦岭': 96, '26.骆彦希': 63, '27.汪子钧': 66, '28.杨涵雅': 78, '29.郑文沛': 75, '30.梁雅婷': 90, '31.徐翠敏': 94,
   '32.于跃悦': 98, '33.王若羲': 67, '34.向芷萱': 94, '35.裴浠为': 63, '36.曾可欣': 99, '37.郑茗予': 60, '38.陈伽余': 100, '39.王语欧': 72, '40.吴臻  ': 79}
b=list(a.keys())
c=list(a.values())
d=0
while d<40:
    print(b[d],c[d])
    d=d+1